## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.roleassignment-uami-kv.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02980afb-c222-4a6f-9436-fb7dad939c6a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Service Encryption User"
      + scope                            = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>